### Assignment Data Cleaning Pandas

In [1]:
# importing necessary packages and libraries
import pandas as pd
import numpy as np

In [2]:
# Creating a dataframe

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
print('\nShape :',df.shape)
print('\n\n',df.info())

Shape : (5, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes


 None

#### Inference
1.We have 5 datapoints with 4 features each hence shape is (5,4).

2.We have two missing values in the feature name "Flight Number".

3.All the features have mix of values hence their datatye is'object',except feature "FlightNumber" which has float as datatype.

### Problem Statement

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column(instead of a float column).

In [4]:
# Logic:As missing values are present in alternate odd rows(as index start from 0)

for i in range(1,5):
    if (i%2!=0):
        df.iloc[[i],[1]]=(df.iloc[[i-1],[1]])+10     # applying the given condition
print(df)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
# converting column 'FlightNumber' from float into int
df.FlightNumber=df.FlightNumber.astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int32
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int32(1), object(3)
memory usage: 268.0+ bytes

### Problem Statement II

2.The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [8]:
df1=df['From_To'].str.split('_',expand=True)
#print(df1)

# now assigning these values to the new columns and removing old columns with unsplitted data
df1['From']=df1[0]
df1['To']=df1[1]
df1.drop(columns=[0,1],axis=1,inplace=True)
print('New Temporary Data Frame\n\n',df1)

New Temporary Data Frame

        From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

### Problem Statement III
3.Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [9]:
df1['From']=df1['From'].str.title()
df1['To']=df1['To'].str.title()
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

### Problem Statement IV
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [10]:
'''Dropping the 'From_to" column and adding the temporary dataframe created in 
   the second problem statement'''

df.drop(labels=['From_To'],axis=1,inplace=True)

# creating new dataframe by concatenating the previous 2 dataframes

df3=pd.concat([df,df1],axis=1)
df3

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### Problem Statement 5
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [ ]:
# Replacing empty list with Nan in second column
df3.RecentDelays = df3.RecentDelays.apply(lambda x: np.nan if len(x)==0 else x)
df3

In [11]:
# Creating 3 seperate lists and storing data

lst1=[df3['RecentDelays'][0][0],np.nan,df3['RecentDelays'][2][0],df3['RecentDelays'][3][0],df3['RecentDelays'][4][0]]
lst2=[df3['RecentDelays'][0][1],np.nan,df3['RecentDelays'][2][1],np.nan,df3['RecentDelays'][4][1]]
lst3=[np.nan,np.nan,df3['RecentDelays'][2][2],np.nan,np.nan]

print('\n',lst1)
print('\n',lst2)
print('\n',lst3)

 [23, nan, 24, 13, 67]

 [47, nan, 43, nan, 32]

 [nan, nan, 87, nan, nan]

In [12]:
# dropping 'Recent Delays' column from the dataframe
df3.drop(columns='RecentDelays',axis=0,inplace=True)

# Adding new columns in the dataframe
df3['Delay_1']=lst1
df3['Delay_2']=lst2
df3['Delay_3']=lst3
df3

,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN